package com.wuyumoom.yusynacc

import org.bukkit.Bukkit
import org.bukkit.plugin.java.JavaPlugin
import java.io.File

class YuSynAcc : JavaPlugin() {
    companion object {
      lateinit var pluginFile: File
        lateinit var INSTANCE: YuSynAcc
        val LOGO = arrayOf(
            "===============================================================================",
            "§f██╗   ██╗██╗   ██╗ ██████╗ ██████╗ ██████╗ ██████╗ ██╗     ███████╗███╗   ███╗ ██████╗ ███╗   ██╗███╗   ██╗██████╗  ██████╗",
            "§f╚██╗ ██╔╝██║   ██║██╔════╝██╔═══██╗██╔══██╗██╔══██╗██║     ██╔════╝████╗ ████║██╔═══██╗████╗  ██║████╗  ██║██╔══██╗██╔════╝",
            "§f ╚████╔╝ ██║   ██║██║     ██║   ██║██████╔╝██████╔╝██║     █████╗  ██╔████╔██║██║   ██║██╔██╗ ██║██╔██╗ ██║██████╔╝██║     ",
            "§f  ╚██╔╝  ██║   ██║██║     ██║   ██║██╔══██╗██╔══██╗██║     ██╔══╝  ██║╚██╔╝██║██║   ██║██║╚██╗██║██║╚██╗██║██╔═══╝ ██║     ",
            "§f   ██║   ╚██████╔╝╚██████╗╚██████╔╝██████╔╝██████╔╝███████╗███████╗██║ ╚═╝ ██║╚██████╔╝██║ ╚████║██║ ╚████║██║     ╚██████╗",
            "§f   ╚═╝    ╚═════╝  ╚═════╝ ╚═════╝ ╚═════╝ ╚═════╝ ╚══════╝╚══════╝╚═╝     ╚═╝ ╚═════╝ ╚═╝  ╚═══╝╚═╝  ╚═══╝╚═╝      ╚═════╝",
            "§e§l语之方可梦NPC §6§l启动完成！",
            "§e§l作者 : 姬无语 §6§lQQ1841375451",
            "==============================================================================="
        )
    }

    override fun onEnable() {
      INSTANCE = this
      saveDefaultConfig()
      Bukkit.getConsoleSender().sendMessage("测试")
      Bukkit.getConsoleSender().sendMessage(*LOGO)
    }

    override fun onDisable() {
    }
}
